---
kind: property
id: P:Autodesk.Revit.DB.FamilyThermalProperties.AnalyticConstructionName
source: html/41f77965-a841-3285-1446-8b3fa732bc05.htm
---
# Autodesk.Revit.DB.FamilyThermalProperties.AnalyticConstructionName Property

The construction gbXML name.
 This value corresponds to the 'Name' property of a constructionType node in Constructions.xml.

## Syntax (C#)
```csharp
public string AnalyticConstructionName { get; }
```